
D:\GIT\ASAVRSD\DebuggerLib\DebugClient\Debug\DebugClient.elf:     file format elf32-avr

Contents of section .data:
 800100 48656c6c 6f20576f 726c640a 0000      Hello World...  
Contents of section .text:
 0000 0c943a00 0c942e02 0c945700 0c945700  ..:.......W...W.
 0010 0c945700 0c945700 0c945700 0c945700  ..W...W...W...W.
 0020 0c945700 0c945700 0c945700 0c945700  ..W...W...W...W.
 0030 0c945700 0c943002 0c945700 0c945700  ..W...0...W...W.
 0040 0c945700 0c945700 0c945700 0c945700  ..W...W...W...W.
 0050 0c945700 0c945700 0c945700 0c945700  ..W...W...W...W.
 0060 0c945700 0c945700 21fea915 84011e95  ..W...W.!.......
 0070 0fb702ff 11241fbe cfefd8e0 debfcdbf  .....$..........
 0080 11e0a0e0 b1e0e6e9 f5e002c0 05900d92  ................
 0090 ae30b107 d9f721e0 aee0b1e0 01c01d92  .0....!.........
 00a0 a231b207 e1f70e94 76020c94 c9020c94  .1......v.......
 00b0 0000e0ec f0e08081 8823ecf7 8091c600  .........#......
 00c0 0895e0ec f0e09081 95fffdcf 8093c600  ................
 00d0 0895f093 3101ffb7 f894f093 3f01e093  ....1.......?...
 00e0 3001e2e1 f1e0d58f c48fb38f c0e0d0e0  0...............
 00f0 b991b193 cb31e1f7 ff90f086 0f910783  .....1..........
 0100 0f93ff92 fdb6f582 feb6f682 11248091  .............$..
 0110 390182fd e8988091 60008093 40019091  9.......`...@...
 0120 600087ef 89278093 600081b5 92b59093  `....'..`.......
 0130 37018093 360180b5 80933801 10923e01  7...6.....8...>.
 0140 0bc0f0e0 e859ff4f 84910e94 61008091  .....Y.O....a...

 <1><563>: Abbrev Number: 80 (DW_TAG_variable)
    <564>   DW_AT_name        : (indirect string, offset: 0x1d9): MCUSR
    <568>   DW_AT_decl_file   : 0
    <569>   DW_AT_decl_line   : 0
    <56a>   DW_AT_type        : <0x14>
    <56e>   DW_AT_external    : 1
    <56f>   DW_AT_location    : 5 byte block: 3 54 0 80 0 	(DW_OP_addr: 800054)
 <1><575>: Abbrev Number: 81 (DW_TAG_variable)
    <576>   DW_AT_name        : (indirect string, offset: 0x1df): SMCR
    <57a>   DW_AT_decl_file   : 0
    <57b>   DW_AT_decl_line   : 0
    <57c>   DW_AT_type        : <0x14>
    <580>   DW_AT_external    : 1
    <581>   DW_AT_location    : 5 byte block: 3 53 0 80 0 	(DW_OP_addr: 800053)
 <1><587>: Abbrev Number: 82 (DW_TAG_variable)
    <588>   DW_AT_name        : (indirect string, offset: 0x1e4): GPIOR2
    <58c>   DW_AT_decl_file   : 0
    <58d>   DW_AT_decl_line   : 0
    <58e>   DW_AT_type        : <0x14>
    <592>   DW_AT_external    : 1
    <593>   DW_AT_location    : 5 byte block: 3 4b 0 80 0 	(DW_OP_addr: 80004b)
 <1><599>: Abbrev Number: 83 (DW_TAG_variable)
    <59a>   DW_AT_name        : (indirect string, offset: 0x1eb): GPIOR1
    <59e>   DW_AT_decl_file   : 0
    <59f>   DW_AT_decl_line   : 0
    <5a0>   DW_AT_type        : <0x14>
    <5a4>   DW_AT_external    : 1
    <5a5>   DW_AT_location    : 5 byte block: 3 4a 0 80 0 	(DW_OP_addr: 80004a)
 <1><5ab>: Abbrev Number: 84 (DW_TAG_variable)
    <5ac>   DW_AT_name        : (indirect string, offset: 0x1f2): GPIOR0
    <5b0>   DW_AT_decl_file   : 0
    <5b1>   DW_AT_decl_line   : 0
    <5b2>   DW_AT_type        : <0x14>
    <5b6>   DW_AT_external    : 1
    <5b7>   DW_AT_location    : 5 byte block: 3 3e 0 80 0 	(DW_OP_addr: 80003e)
 <1><5bd>: Abbrev Number: 85 (DW_TAG_variable)
    <5be>   DW_AT_name        : (indirect string, offset: 0x1f9): EEAR
    <5c2>   DW_AT_decl_file   : 0
    <5c3>   DW_AT_decl_line   : 0
    <5c4>   DW_AT_type        : <0x1b>
    <5c8>   DW_AT_external    : 1
    <5c9>   DW_AT_location    : 5 byte block: 3 41 0 80 0 	(DW_OP_addr: 800041)
 <1><5cf>: Abbrev Number: 86 (DW_TAG_variable)
    <5d0>   DW_AT_name        : (indirect string, offset: 0x1fe): EEDR
    <5d4>   DW_AT_decl_file   : 0
    <5d5>   DW_AT_decl_line   : 0
    <5d6>   DW_AT_type        : <0x14>
    <5da>   DW_AT_external    : 1
    <5db>   DW_AT_location    : 5 byte block: 3 40 0 80 0 	(DW_OP_addr: 800040)
 <1><5e1>: Abbrev Number: 87 (DW_TAG_variable)
    <5e2>   DW_AT_name        : (indirect string, offset: 0x203): EECR
    <5e6>   DW_AT_decl_file   : 0
    <5e7>   DW_AT_decl_line   : 0
    <5e8>   DW_AT_type        : <0x14>
    <5ec>   DW_AT_external    : 1
    <5ed>   DW_AT_location    : 5 byte block: 3 3f 0 80 0 	(DW_OP_addr: 80003f)
 <1><5f3>: Abbrev Number: 0
  Compilation Unit @ offset 0x5f4:
   Length:        0x73f (32-bit)
   Version:       2
   Abbrev Offset: 0x5a2
   Pointer Size:  4
 <0><5ff>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <600>   DW_AT_producer    : (indirect string, offset: 0x2cf): GNU C 4.9.2 -mn-flash=1 -mno-skip-bug -mmcu=avr5 -g2 -O1 -std=gnu99 -funsigned-char -funsigned-bitfields -ffunction-sections -fdata-sections -fpack-struct -fshort-enums
    <604>   DW_AT_language    : 1	(ANSI C)
    <605>   DW_AT_name        : (indirect string, offset: 0x482): ../debugger/debug.c
    <609>   DW_AT_comp_dir    : (indirect string, offset: 0x281): D:\GIT\ASAVRSD\DebuggerLib\DebugClient\Debug
    <60d>   DW_AT_ranges      : 0x18
    <611>   DW_AT_low_pc      : 0x0
    <615>   DW_AT_entry_pc    : 0x0
    <619>   DW_AT_stmt_list   : 0x133
 <1><61d>: Abbrev Number: 2 (DW_TAG_base_type)
    <61e>   DW_AT_byte_size   : 1
    <61f>   DW_AT_encoding    : 6	(signed char)
    <620>   DW_AT_name        : (indirect string, offset: 0x3b9): signed char
 <1><624>: Abbrev Number: 3 (DW_TAG_typedef)
    <625>   DW_AT_name        : (indirect string, offset: 0x279): uint8_t
    <629>   DW_AT_decl_file   : 2
    <62a>   DW_AT_decl_line   : 126
    <62b>   DW_AT_type        : <0x62f>
 <1><62f>: Abbrev Number: 2 (DW_TAG_base_type)
    <630>   DW_AT_byte_size   : 1
    <631>   DW_AT_encoding    : 8	(unsigned char)
    <632>   DW_AT_name        : (indirect string, offset: 0x3b7): unsigned char
 <1><636>: Abbrev Number: 4 (DW_TAG_base_type)
    <637>   DW_AT_byte_size   : 2
    <638>   DW_AT_encoding    : 5	(signed)
    <639>   DW_AT_name        : int
 <1><63d>: Abbrev Number: 3 (DW_TAG_typedef)
    <63e>   DW_AT_name        : (indirect string, offset: 0x3f1): uint16_t
    <642>   DW_AT_decl_file   : 2
    <643>   DW_AT_decl_line   : 128
    <644>   DW_AT_type        : <0x648>
 <1><648>: Abbrev Number: 2 (DW_TAG_base_type)
    <649>   DW_AT_byte_size   : 2
    <64a>   DW_AT_encoding    : 7	(unsigned)
    <64b>   DW_AT_name        : (indirect string, offset: 0x3e4): unsigned int
 <1><64f>: Abbrev Number: 2 (DW_TAG_base_type)
    <650>   DW_AT_byte_size   : 4
    <651>   DW_AT_encoding    : 5	(signed)
    <652>   DW_AT_name        : (indirect string, offset: 0x2c6): long int
 <1><656>: Abbrev Number: 2 (DW_TAG_base_type)
    <657>   DW_AT_byte_size   : 4
    <658>   DW_AT_encoding    : 7	(unsigned)
    <659>   DW_AT_name        : (indirect string, offset: 0x3df): long unsigned int
 <1><65d>: Abbrev Number: 2 (DW_TAG_base_type)
    <65e>   DW_AT_byte_size   : 8
    <65f>   DW_AT_encoding    : 5	(signed)
    <660>   DW_AT_name        : (indirect string, offset: 0x2c1): long long int
 <1><664>: Abbrev Number: 2 (DW_TAG_base_type)
    <665>   DW_AT_byte_size   : 8
    <666>   DW_AT_encoding    : 7	(unsigned)
    <667>   DW_AT_name        : (indirect string, offset: 0x3da): long long unsigned int
 <1><66b>: Abbrev Number: 5 (DW_TAG_structure_type)
    <66c>   DW_AT_byte_size   : 2
    <66d>   DW_AT_decl_file   : 1
    <66e>   DW_AT_decl_line   : 203
    <66f>   DW_AT_sibling     : <0x68c>
 <2><673>: Abbrev Number: 6 (DW_TAG_member)
    <674>   DW_AT_name        : l
    <676>   DW_AT_decl_file   : 1
    <677>   DW_AT_decl_line   : 204
    <678>   DW_AT_type        : <0x624>
    <67c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><67f>: Abbrev Number: 6 (DW_TAG_member)
    <680>   DW_AT_name        : h
    <682>   DW_AT_decl_file   : 1
    <683>   DW_AT_decl_line   : 205
    <684>   DW_AT_type        : <0x624>
    <688>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><68b>: Abbrev Number: 0
 <1><68c>: Abbrev Number: 3 (DW_TAG_typedef)
    <68d>   DW_AT_name        : (indirect string, offset: 0x3ca): st_16bit_struct
    <691>   DW_AT_decl_file   : 1
    <692>   DW_AT_decl_line   : 206
    <693>   DW_AT_type        : <0x66b>
 <1><697>: Abbrev Number: 7 (DW_TAG_union_type)
    <698>   DW_AT_byte_size   : 2
    <699>   DW_AT_decl_file   : 1
    <69a>   DW_AT_decl_line   : 208
    <69b>   DW_AT_sibling     : <0x6b5>
 <2><69f>: Abbrev Number: 8 (DW_TAG_member)
    <6a0>   DW_AT_name        : d8
    <6a3>   DW_AT_decl_file   : 1
    <6a4>   DW_AT_decl_line   : 209
    <6a5>   DW_AT_type        : <0x68c>
 <2><6a9>: Abbrev Number: 8 (DW_TAG_member)
    <6aa>   DW_AT_name        : d16
    <6ae>   DW_AT_decl_file   : 1
    <6af>   DW_AT_decl_line   : 210
    <6b0>   DW_AT_type        : <0x63d>
 <2><6b4>: Abbrev Number: 0
 <1><6b5>: Abbrev Number: 3 (DW_TAG_typedef)
    <6b6>   DW_AT_name        : (indirect string, offset: 0x380): tu_uint16
    <6ba>   DW_AT_decl_file   : 1
    <6bb>   DW_AT_decl_line   : 211
    <6bc>   DW_AT_type        : <0x697>
 <1><6c0>: Abbrev Number: 7 (DW_TAG_union_type)
    <6c1>   DW_AT_byte_size   : 2
    <6c2>   DW_AT_decl_file   : 1
    <6c3>   DW_AT_decl_line   : 213
    <6c4>   DW_AT_sibling     : <0x6ea>
 <2><6c8>: Abbrev Number: 9 (DW_TAG_member)
    <6c9>   DW_AT_name        : (indirect string, offset: 0x232): nibbles
    <6cd>   DW_AT_decl_file   : 1
    <6ce>   DW_AT_decl_line   : 214
    <6cf>   DW_AT_type        : <0x68c>
 <2><6d3>: Abbrev Number: 9 (DW_TAG_member)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x40b): addr
    <6d8>   DW_AT_decl_file   : 1
    <6d9>   DW_AT_decl_line   : 215
    <6da>   DW_AT_type        : <0x63d>
 <2><6de>: Abbrev Number: 8 (DW_TAG_member)
    <6df>   DW_AT_name        : ptr
    <6e3>   DW_AT_decl_file   : 1
    <6e4>   DW_AT_decl_line   : 216
    <6e5>   DW_AT_type        : <0x6ea>
 <2><6e9>: Abbrev Number: 0
 <1><6ea>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <6eb>   DW_AT_byte_size   : 2
    <6ec>   DW_AT_type        : <0x624>
 <1><6f0>: Abbrev Number: 3 (DW_TAG_typedef)
    <6f1>   DW_AT_name        : (indirect string, offset: 0x512): tu_puint8
    <6f5>   DW_AT_decl_file   : 1
    <6f6>   DW_AT_decl_line   : 217
    <6f7>   DW_AT_type        : <0x6c0>
 <1><6fb>: Abbrev Number: 5 (DW_TAG_structure_type)
    <6fc>   DW_AT_byte_size   : 4
    <6fd>   DW_AT_decl_file   : 1
    <6fe>   DW_AT_decl_line   : 219
    <6ff>   DW_AT_sibling     : <0x720>
 <2><703>: Abbrev Number: 11 (DW_TAG_member)
    <704>   DW_AT_name        : (indirect string, offset: 0x4ca): size
    <708>   DW_AT_decl_file   : 1
    <709>   DW_AT_decl_line   : 220
    <70a>   DW_AT_type        : <0x6b5>
    <70e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><711>: Abbrev Number: 11 (DW_TAG_member)
    <712>   DW_AT_name        : (indirect string, offset: 0x441): buff
    <716>   DW_AT_decl_file   : 1
    <717>   DW_AT_decl_line   : 221
    <718>   DW_AT_type        : <0x6f0>
    <71c>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><71f>: Abbrev Number: 0
 <1><720>: Abbrev Number: 3 (DW_TAG_typedef)
    <721>   DW_AT_name        : (indirect string, offset: 0x531): t_mem_op_8
    <725>   DW_AT_decl_file   : 1
    <726>   DW_AT_decl_line   : 222
    <727>   DW_AT_type        : <0x6fb>
 <1><72b>: Abbrev Number: 5 (DW_TAG_structure_type)
    <72c>   DW_AT_byte_size   : 3
    <72d>   DW_AT_decl_file   : 1
    <72e>   DW_AT_decl_line   : 234
    <72f>   DW_AT_sibling     : <0x750>
 <2><733>: Abbrev Number: 11 (DW_TAG_member)
    <734>   DW_AT_name        : (indirect string, offset: 0x3c5): eear
    <738>   DW_AT_decl_file   : 1
    <739>   DW_AT_decl_line   : 235
    <73a>   DW_AT_type        : <0x63d>
    <73e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><741>: Abbrev Number: 11 (DW_TAG_member)
    <742>   DW_AT_name        : (indirect string, offset: 0x2bc): eedr
    <746>   DW_AT_decl_file   : 1
    <747>   DW_AT_decl_line   : 237
    <748>   DW_AT_type        : <0x624>
    <74c>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><74f>: Abbrev Number: 0
 <1><750>: Abbrev Number: 3 (DW_TAG_typedef)
    <751>   DW_AT_name        : (indirect string, offset: 0x38a): t_eeprom_regs
    <755>   DW_AT_decl_file   : 1
    <756>   DW_AT_decl_line   : 239
    <757>   DW_AT_type        : <0x72b>
 <1><75b>: Abbrev Number: 5 (DW_TAG_structure_type)
    <75c>   DW_AT_byte_size   : 36
    <75d>   DW_AT_decl_file   : 1
    <75e>   DW_AT_decl_line   : 243
    <75f>   DW_AT_sibling     : <0x78e>
 <2><763>: Abbrev Number: 11 (DW_TAG_member)
    <764>   DW_AT_name        : (indirect string, offset: 0x42b): _registers
    <768>   DW_AT_decl_file   : 1
    <769>   DW_AT_decl_line   : 244
    <76a>   DW_AT_type        : <0x78e>
    <76e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><771>: Abbrev Number: 11 (DW_TAG_member)
    <772>   DW_AT_name        : (indirect string, offset: 0x227): _stack_ptr
    <776>   DW_AT_decl_file   : 1
    <777>   DW_AT_decl_line   : 245
    <778>   DW_AT_type        : <0x6f0>
    <77c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><77f>: Abbrev Number: 11 (DW_TAG_member)
    <780>   DW_AT_name        : (indirect string, offset: 0x403): _return_addr
    <784>   DW_AT_decl_file   : 1
    <785>   DW_AT_decl_line   : 246
    <786>   DW_AT_type        : <0x6b5>
    <78a>   DW_AT_data_member_location: 2 byte block: 23 22 	(DW_OP_plus_uconst: 34)
 <2><78d>: Abbrev Number: 0
 <1><78e>: Abbrev Number: 12 (DW_TAG_array_type)
    <78f>   DW_AT_type        : <0x624>
    <793>   DW_AT_sibling     : <0x79e>
 <2><797>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <798>   DW_AT_type        : <0x79e>
    <79c>   DW_AT_upper_bound : 31
 <2><79d>: Abbrev Number: 0
 <1><79e>: Abbrev Number: 2 (DW_TAG_base_type)
    <79f>   DW_AT_byte_size   : 2
    <7a0>   DW_AT_encoding    : 7	(unsigned)
    <7a1>   DW_AT_name        : (indirect string, offset: 0x21e): sizetype
 <1><7a5>: Abbrev Number: 3 (DW_TAG_typedef)
    <7a6>   DW_AT_name        : (indirect string, offset: 0x4fb): t_state_ctx
    <7aa>   DW_AT_decl_file   : 1
    <7ab>   DW_AT_decl_line   : 247
    <7ac>   DW_AT_type        : <0x75b>
 <1><7b0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <7b1>   DW_AT_byte_size   : 47
    <7b2>   DW_AT_decl_file   : 1
    <7b3>   DW_AT_decl_line   : 258
    <7b5>   DW_AT_sibling     : <0x823>
 <2><7b9>: Abbrev Number: 15 (DW_TAG_member)
    <7ba>   DW_AT_name        : (indirect string, offset: 0x42c): registers
    <7be>   DW_AT_decl_file   : 1
    <7bf>   DW_AT_decl_line   : 262
    <7c1>   DW_AT_type        : <0x7a5>
    <7c5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><7c8>: Abbrev Number: 15 (DW_TAG_member)
    <7c9>   DW_AT_name        : (indirect string, offset: 0x38c): eeprom_regs
    <7cd>   DW_AT_decl_file   : 1
    <7ce>   DW_AT_decl_line   : 272
    <7d0>   DW_AT_type        : <0x750>
    <7d4>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><7d7>: Abbrev Number: 15 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0x208): ctx_state
    <7dc>   DW_AT_decl_file   : 1
    <7dd>   DW_AT_decl_line   : 277
    <7df>   DW_AT_type        : <0x624>
    <7e3>   DW_AT_data_member_location: 2 byte block: 23 27 	(DW_OP_plus_uconst: 39)
 <2><7e6>: Abbrev Number: 15 (DW_TAG_member)
    <7e7>   DW_AT_name        : (indirect string, offset: 0x46f): mem_op
    <7eb>   DW_AT_decl_file   : 1
    <7ec>   DW_AT_decl_line   : 279
    <7ee>   DW_AT_type        : <0x720>
    <7f2>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><7f5>: Abbrev Number: 15 (DW_TAG_member)
    <7f6>   DW_AT_name        : (indirect string, offset: 0x47b): tmp_u8
    <7fa>   DW_AT_decl_file   : 1
    <7fb>   DW_AT_decl_line   : 280
    <7fd>   DW_AT_type        : <0x624>
    <801>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><804>: Abbrev Number: 15 (DW_TAG_member)
    <805>   DW_AT_name        : (indirect string, offset: 0x23a): status_reg
    <809>   DW_AT_decl_file   : 1
    <80a>   DW_AT_decl_line   : 281
    <80c>   DW_AT_type        : <0x624>
    <810>   DW_AT_data_member_location: 2 byte block: 23 2d 	(DW_OP_plus_uconst: 45)
 <2><813>: Abbrev Number: 15 (DW_TAG_member)
    <814>   DW_AT_name        : (indirect string, offset: 0x4db): watchdog
    <818>   DW_AT_decl_file   : 1
    <819>   DW_AT_decl_line   : 282
    <81b>   DW_AT_type        : <0x624>
    <81f>   DW_AT_data_member_location: 2 byte block: 23 2e 	(DW_OP_plus_uconst: 46)
 <2><822>: Abbrev Number: 0
 <1><823>: Abbrev Number: 16 (DW_TAG_typedef)
    <824>   DW_AT_name        : (indirect string, offset: 0x2ae): t_dbg_context
    <828>   DW_AT_decl_file   : 1
    <829>   DW_AT_decl_line   : 283
    <82b>   DW_AT_type        : <0x7b0>
 <1><82f>: Abbrev Number: 17 (DW_TAG_subprogram)
    <830>   DW_AT_name        : (indirect string, offset: 0x4ba): dbg_enter_debug
    <834>   DW_AT_decl_file   : 1
    <835>   DW_AT_decl_line   : 471
    <837>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><838>: Abbrev Number: 17 (DW_TAG_subprogram)
    <839>   DW_AT_name        : (indirect string, offset: 0x410): dbg_leave_debug
    <83d>   DW_AT_decl_file   : 1
    <83e>   DW_AT_decl_line   : 485
    <840>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><841>: Abbrev Number: 18 (DW_TAG_subprogram)
    <842>   DW_AT_external    : 1
    <843>   DW_AT_name        : (indirect string, offset: 0x3ac): dbg_get_ch
    <847>   DW_AT_decl_file   : 1
    <848>   DW_AT_decl_line   : 510
    <84a>   DW_AT_type        : <0x624>
    <84e>   DW_AT_low_pc      : 0xb2
    <852>   DW_AT_high_pc     : 0xc2
    <856>   DW_AT_frame_base  : 3 byte block: 92 20 2 	(DW_OP_bregx: 32 (r32) 2)
    <85a>   DW_AT_GNU_all_call_sites: 1
 <1><85b>: Abbrev Number: 19 (DW_TAG_subprogram)
    <85c>   DW_AT_external    : 1
    <85d>   DW_AT_name        : (indirect string, offset: 0x507): dbg_put_ch
    <861>   DW_AT_decl_file   : 1
    <862>   DW_AT_decl_line   : 515
    <864>   DW_AT_prototyped  : 1
    <865>   DW_AT_low_pc      : 0xc2
    <869>   DW_AT_high_pc     : 0xd2
    <86d>   DW_AT_frame_base  : 3 byte block: 92 20 2 	(DW_OP_bregx: 32 (r32) 2)
    <871>   DW_AT_GNU_all_call_sites: 1
    <872>   DW_AT_sibling     : <0x885>
 <2><876>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <877>   DW_AT_name        : (indirect string, offset: 0x476): data
    <87b>   DW_AT_decl_file   : 1
    <87c>   DW_AT_decl_line   : 515
    <87e>   DW_AT_type        : <0x624>
    <882>   DW_AT_location    : 1 byte block: 68 	(DW_OP_reg24 (r24))
 <2><884>: Abbrev Number: 0
 <1><885>: Abbrev Number: 17 (DW_TAG_subprogram)
    <886>   DW_AT_name        : (indirect string, offset: 0x266): dbg_save_registers
    <88a>   DW_AT_decl_file   : 1
    <88b>   DW_AT_decl_line   : 353
    <88d>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><88e>: Abbrev Number: 17 (DW_TAG_subprogram)
    <88f>   DW_AT_name        : (indirect string, offset: 0x496): disable_single_step
    <893>   DW_AT_decl_file   : 1
    <894>   DW_AT_decl_line   : 307
    <896>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><897>: Abbrev Number: 17 (DW_TAG_subprogram)
    <898>   DW_AT_name        : (indirect string, offset: 0x4cf): dbg_disable_watchdog
    <89c>   DW_AT_decl_file   : 1
    <89d>   DW_AT_decl_line   : 498
    <89f>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><8a0>: Abbrev Number: 17 (DW_TAG_subprogram)
    <8a1>   DW_AT_name        : (indirect string, offset: 0x4aa): dbg_save_eeprom
    <8a5>   DW_AT_decl_file   : 1
    <8a6>   DW_AT_decl_line   : 452
    <8a8>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><8a9>: Abbrev Number: 21 (DW_TAG_subprogram)
    <8aa>   DW_AT_name        : (indirect string, offset: 0x245): dbg_send_info
    <8ae>   DW_AT_decl_file   : 1
    <8af>   DW_AT_decl_line   : 533
    <8b1>   DW_AT_inline      : 3	(declared as inline and inlined)
    <8b2>   DW_AT_sibling     : <0x8d1>
 <2><8b6>: Abbrev Number: 22 (DW_TAG_lexical_block)
 <3><8b7>: Abbrev Number: 23 (DW_TAG_variable)
    <8b8>   DW_AT_name        : (indirect string, offset: 0x3a3): __addr16
    <8bc>   DW_AT_decl_file   : 1
    <8bd>   DW_AT_decl_line   : 535
    <8bf>   DW_AT_type        : <0x63d>
 <3><8c3>: Abbrev Number: 23 (DW_TAG_variable)
    <8c4>   DW_AT_name        : (indirect string, offset: 0x3fa): __result
